app/controllers/nexus_controller.rb

SELECT "blocks".* FROM "blocks"
---
  def index
    @blocks = Block.find :all

SELECT "blocks".* FROM "blocks"
---
  def get_blocks
    render :json => (Block.find :all).to_json

INSERT INTO "blocks" ("body", "coorX", "coorY", "created_at", "img", "summary", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create_block
    block = Block.create! params[:block]

SELECT "blocks".* FROM "blocks" WHERE "blocks"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "blocks" WHERE "blocks"."id" = ?  [["id", 4]]
---
  def delete_block
    block = Block.find (params[:id])
    block.destroy

DELETE FROM "blocks" WHERE "blocks"."id" = ?  [["id", 2]]
---
  def clear_all
    Block.destroy_all